trade_exp/src/Documents/АрендаНоменклатуры/АрендаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АрендаНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="966054c7-5235-482e-b7ef-15ace606ebe4">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c78dceba-50e8-4a3a-a189-e0760aabee53">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c94dfe3d-8911-4256-a142-56e1f43c983d">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95c7f89a-c817-4972-84cf-d247b0380708">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00337579-5832-4d28-81cc-32fbfc41ec80">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6edf55c-070b-4085-88b1-42ee5c4ac2e6">
    <name>ДатаСдачиВАренду</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5cb6017c-244e-47bb-9962-3b1ec3a31dcf">
    <name>ДатаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59141cf6-ba27-416a-b77b-31cf9d3d543d">
    <name>СуммаУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fcd1bab2-b145-415d-a939-c3ca529402ef">
    <name>СуммаЗалога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7782ab60-d402-404d-8054-62575936bba4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfb71ace-feb4-440a-be59-7c5e4e13b134">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a36040b2-042c-4b2f-96f1-c42e400bc7f3">
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="874bb0b2-2466-4cbf-be1c-093ad26e65c0">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a976ece0-ac77-417e-8b2d-0962b97145c9">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="277e9b24-4633-4cf3-819b-447bfbf8959d">
    <name>ВозвратОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7d7fce9-a9a8-4b47-8ce8-1df200b57792">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b72c666-ceb1-478a-b71c-104ac8b9e06c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ccdb1b7f-3811-4474-8d82-b9392008cb37">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4d570980-c1b7-454e-bf59-c595c475658d">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="20c4d67c-cf72-44c7-a6cc-f9347489b7a2">
      <name>ДатаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1dee34e4-71aa-48f9-a004-2116675a31ad">
      <name>ЦенаУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6778c420-c4bd-4ba5-bde6-a062087b5271">
      <name>СуммаЗалога</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aac6aef2-88ab-4d3e-8331-c4b02c35eb75">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ccbc682f-b82c-42b9-acb5-dae9839d6c53">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e79414f3-52e7-4477-a11f-1e5f81f0754f">
      <name>УслугаАренды</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d842a7a8-1e16-430f-9c57-f7ef29f5ecd3">
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9ac114a8-1e27-442e-8a46-45dda0972b02">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60fb7b62-9cd6-47b6-a642-6696dada9849">
      <name>КоличествоУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1d9739fe-52ea-440d-b9f4-1855645fc816">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="860ca8e7-dc30-498a-9223-564dea61ee2c">
      <name>СуммаСНДСУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1a4991f8-7832-4ca9-8809-88a97de88749">
  <name>ДокументыФизическихЛиц</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="4f44c1c0-0480-415e-8058-41b28f2f43a0">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3b708ec7-6543-40ff-8ea2-16d4ddb7d56f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="433e502d-ab5c-4e8e-a7c0-0fde1aa6f767">
    <name>ДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6bd65f02-9531-4dd4-bd4a-4132aa3c4787">
    <name>СрокДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d9863e6-aab7-4808-a516-8bc42dae5d01">
    <name>КемВыдан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a2910bb8-fdd2-480c-8ae2-78661d7d18e0">
    <name>КодПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="218302fa-674d-45e1-a7e2-2cce2d011342">
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="70264a0a-95c5-426f-a1bf-0f57b86d4030">
    <name>Представление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="cadcf4bd-2047-4fcb-b58e-bd6c09c5577a">
    <name>ФамилияЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e22a7536-dd59-4093-bfc8-335178b9da44">
    <name>ИмяЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="af40a979-1391-4411-b5a4-9f9a91fb8123">
    <name>СтранаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="365ca951-7fbf-4ad3-9004-47c3ef48b3bd">
    <name>КатегорииТранспортныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="a231846e-d31a-4f94-9c9f-1e18d525af6c">
    <name>АдресПрописки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ac3dc5c4-e172-49f9-b95f-4221e68f3600">
    <name>АдресПроживания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0495d913-3a33-41b9-9065-56d730c8fc56">
    <name>СовпадаетСПропиской</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="3291428e-6727-43cc-a1f8-c62f90320e90">
    <name>Физлицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d867720c-c937-4689-b241-0afda05ef993">
    <name>ВидДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/АрендаНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СозданиеНаОсновании
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.АрендаНоменклатурыВозврат.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);   
	
КонецПроцедуры       

#КонецОбласти 

Функция ПолучитьЦену(Номенклатура, Характеристика, ВидЦены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена; 
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция РасчитатьСтоимостьЗалога(Номенклатура, Характеристика, Подразделение) Экспорт
	
	ЦенаТовара = ПолучитьЦену(Номенклатура, Характеристика, Подразделение.ЦенаПоКарте);
	Если ЦенаТовара = 0 Тогда
		Сообщить("Стоимость товара по карте равна нулю", СтатусСообщения.ОченьВажное);
		Возврат 0;
	КонецЕсли;
	
	Залог = Цел(ЦенаТовара / 10 / 50) * 50 + 50;
	
	Возврат Залог; 
	
КонецФункции

Функция ЕстьОстаткиПоАренде(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АрендаНоменклатурыОстатки.Организация КАК Организация,
	|	АрендаНоменклатурыОстатки.Подразделение КАК Подразделение,
	|	АрендаНоменклатурыОстатки.Партнер КАК Партнер,
	|	АрендаНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	АрендаНоменклатурыОстатки.Характеристика КАК Характеристика,
	|	АрендаНоменклатурыОстатки.КАрендеОстаток КАК КАрендеОстаток,
	|	АрендаНоменклатурыОстатки.ВАрендеОстаток КАК ВАрендеОстаток
	|ИЗ
	|	РегистрНакопления.АрендаНоменклатуры.Остатки(, ДокументАренды = &ДокументАренды) КАК АрендаНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("ДокументАренды", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьВозвратАренды(Основание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АрендаНоменклатурыВозврат.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АрендаНоменклатурыВозврат КАК АрендаНоменклатурыВозврат
	|ГДЕ
	|	АрендаНоменклатурыВозврат.Основание = &Основание
	|	И АрендаНоменклатурыВозврат.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;  
	
КонецФункции

Функция ЕстьПКО_РКО(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Ссылка.Проведен
		|	И ПриходныйКассовыйОрдер.ДокументОснование = &ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.Ссылка.Проведен
		|	И РасходныйКассовыйОрдер.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой(); 
	
КонецФункции

Функция ЕстьВозврат(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АрендаНоменклатурыВозврат.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.АрендаНоменклатурыВозврат КАК АрендаНоменклатурыВозврат
		|ГДЕ
		|	АрендаНоменклатурыВозврат.Ссылка.Проведен
		|	И АрендаНоменклатурыВозврат.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой(); 
	
КонецФункции

Функция ПолучитьСуммуВнесенногоЗаолога(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ПриходныйКассовыйОрдер.СуммаДокумента, 0)) КАК СуммаДокумента
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Ссылка.Проведен
		|	И ПриходныйКассовыйОрдер.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаДокумента;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#Область Перемещение
Процедура СоздатьДокументПеремещение(Основание, Отказ) Экспорт
	
	Перемещение = ПолучитьПеремещение(Основание);
	Если Не ЗначениеЗаполнено(Перемещение) Тогда
		ДокПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	Иначе
		ДокПеремещение = Перемещение.ПолучитьОбъект();
	КонецЕсли;
	
	ДокПеремещение.Заполнить(Основание);
	
	Попытка
		Если ДокПеремещение.ПометкаУдаления Тогда
			ДокПеремещение.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		ДокПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Записан: " + ДокПеремещение, ДокПеремещение);
	Исключение
		Отказ = Истина;
		Сообщить(ИнформацияОбОшибке().Описание);
		Сообщить("Не удалось записать перемещение", СтатусСообщения.ОченьВажное);
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьДокументПеремещение(Основание, Отказ) Экспорт

	Перемещение = ПолучитьПеремещение(Основание);
	Если ЗначениеЗаполнено(Перемещение) Тогда
		ДокПеремещение = Перемещение.ПолучитьОбъект();
	
		Попытка
			ДокПеремещение.УстановитьПометкуУдаления(Истина);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Удален: " + ДокПеремещение, ДокПеремещение);
		Исключение
			Отказ = Истина;
			Сообщить("Не удалось записать перемещение", СтатусСообщения.ОченьВажное);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПеремещение(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции
#КонецОбласти 


#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.АрендаНоменклатуры";
	КомандаПечати.Идентификатор = "Договор";
	КомандаПечати.Представление = НСтр("ru = 'Договор'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 1; 
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Договор") Тогда
		ТабДок = СформироватьДоговор(МассивОбъектов);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"Договор", НСтр("ru = 'Договор'"), ТабДок, "Документ.АрендаНоменклатуры.Договор");
	КонецЕсли;	
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);	

КонецПроцедуры

Функция СформироватьДоговор(МассивОбъектов) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если МассивОбъектов.Количество() = 1 Тогда
		Ссылка = МассивОбъектов[0];
		СтатусСсылки = Ссылка.Статус;
		Если СтатусСсылки <> Перечисления.СтатусыАренды.ВАренде И СтатусСсылки <> Перечисления.СтатусыАренды.Выполнен Тогда
			Если Не (РольДоступна("_ОтделБухгалтерии") ИЛИ РольДоступна("ПолныеПрава")) Тогда
				Сообщить("Договор печатается для документов в статусе в аренде или выполнен!");
				Возврат ТабДок;
			КонецЕсли;
		КонецЕсли;
		
		РезультатЗапроса = ПолучитьДанныеДляДоговораНесколькоДоговоров(МассивОбъектов, СтатусСсылки);
	Иначе
		РезультатЗапроса = ПолучитьДанныеДляДоговораНесколькоДоговоров(МассивОбъектов, Перечисления.СтатусыАренды.ВАренде);
	КонецЕсли;
	                        
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АрендаНоменклатуры.Договор");
	
	ОбластьКартинкиШапки = Макет.ПолучитьОбласть("Шапка_Логотип");
	ОбластьКартинкиПодвала = Макет.ПолучитьОбласть("Подвал_Лого");

	ОбластьШтрихкода = Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьТовар = Макет.ПолучитьОбласть("Товар");
	ОбластьОсновнаяЧасть = Макет.ПолучитьОбласть("ОсновнаяЧасть");
	ВыборкаДоговора = РезультатЗапроса.Выбрать();
	Пока ВыборкаДоговора.Следующий() Цикл
		ТабДок.Вывести(ОбластьКартинкиШапки);

		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьШтрихкода, ВыборкаДоговора.Ссылка);
		ТабДок.Вывести(ОбластьШтрихкода);
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДоговора);
	
		ОбластьЗаголовок.Параметры.ДатаВремя = Формат(ВыборкаДоговора.Дата, "ДФ=dd.MM.yyyy hh:mm");

		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьТовар.Параметры.Заполнить(ВыборкаДоговора);
		ТабДок.Вывести(ОбластьТовар);
		
		ОбластьОсновнаяЧасть.Параметры.Заполнить(ВыборкаДоговора);
		ТабДок.Вывести(ОбластьОсновнаяЧасть);
		
		ТабДок.Вывести(ОбластьКартинкиПодвала);
	
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;	

	ТабДок.АвтоМасштаб = Истина;

	Возврат ТабДок;
	
КонецФункции 

Функция ПолучитьДанныеДляДоговора(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АрендаНоменклатуры.Ссылка КАК Ссылка,
	|	АрендаНоменклатуры.Номер КАК Номер,
	|	АрендаНоменклатуры.Дата КАК Дата,
	|	АрендаНоменклатуры.Организация.ИНН КАК ИНН,
	|	АрендаНоменклатуры.Подразделение КАК Подразделение,
	|	АрендаНоменклатуры.Подразделение.Адрес КАК ПодразделениеАдрес,
	|	АрендаНоменклатуры.Автор.Наименование КАК Сотрудник,
	|	Сотрудники.Должность.Наименование КАК Должность,
	|	АрендаНоменклатуры.Контрагент.Наименование КАК КлиентФИО,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК Паспорт,
	|	АрендаНоменклатуры.Организация.Наименование КАК Организация,
	|	ПартнерыКонтактнаяИнформацияАдрес.Представление КАК КлиентАдрес,
	|	ПартнерыКонтактнаяИнформацияТелефон.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Документ.АрендаНоменклатуры КАК АрендаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО АрендаНоменклатуры.Автор = Сотрудники.Пользователь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|		ПО АрендаНоменклатуры.Контрагент = ДокументыФизическихЛицСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияАдрес
	|		ПО АрендаНоменклатуры.Партнер = ПартнерыКонтактнаяИнформацияАдрес.Ссылка
	|			И (ПартнерыКонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПартнера))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияТелефон
	|		ПО (АрендаНоменклатуры.Партнер = ПартнерыКонтактнаяИнформацияАдрес.Ссылка)
	|			И (ПартнерыКонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера))
	|ГДЕ
	|	АрендаНоменклатуры.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АрендаНоменклатурыТовары.НомерСтроки КАК Ном,
	|	АрендаНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	АрендаНоменклатурыТовары.Характеристика КАК Характеристика,
	|	АрендаНоменклатурыТовары.ЦенаУслуги КАК ЦенаУслуги,
	|	АрендаНоменклатурыТовары.КоличествоУслуги КАК КоличествоУслуги,
	|	АрендаНоменклатурыТовары.СуммаЗалога КАК СуммаЗалога
	|	, ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	Документ.АрендаНоменклатуры.Товары КАК АрендаНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО АрендаНоменклатурыТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И АрендаНоменклатурыТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			И АрендаНоменклатурыТовары.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|ГДЕ
	|	АрендаНоменклатурыТовары.Ссылка В(&МассивДокументов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Период", МассивОбъектов[МассивОбъектов.Количество()-1].Дата);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса; 
	
КонецФункции

Функция ПолучитьДанныеДляДоговораНесколькоДоговоров(МассивОбъектов, Статус)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АрендаНоменклатуры.Ссылка КАК Ссылка,
	|	АрендаНоменклатуры.Номер КАК Номер,
	|	АрендаНоменклатуры.Дата КАК Дата,
	|	АрендаНоменклатуры.Организация.ИНН КАК ИНН,
	|	АрендаНоменклатуры.Подразделение КАК Подразделение,
	|	АрендаНоменклатуры.Подразделение.Адрес КАК ПодразделениеАдрес,
	|	АрендаНоменклатуры.Автор.Наименование КАК Сотрудник,
	|	Сотрудники.Должность.Наименование КАК Должность,
	|	АрендаНоменклатуры.Контрагент.Наименование КАК КлиентФИО,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК Паспорт,
	|	АрендаНоменклатуры.Организация.Наименование КАК Организация,
	|	ДокументыФизическихЛицСрезПоследних.АдресПрописки КАК КлиентАдрес,
	|	ПартнерыКонтактнаяИнформацияТелефон.НомерТелефона КАК НомерТелефона,
	|	АрендаНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	АрендаНоменклатурыТовары.Характеристика КАК Характеристика,
	|	АрендаНоменклатурыТовары.ЦенаУслуги КАК ЦенаУслуги,
	|	АрендаНоменклатурыТовары.КоличествоУслуги КАК КоличествоУслуги,
	|	АрендаНоменклатурыТовары.СуммаЗалога КАК СуммаЗалога,
	|	АрендаНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
	|	АрендаНоменклатурыТовары.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.АрендаНоменклатуры КАК АрендаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО АрендаНоменклатуры.Автор = Сотрудники.Пользователь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|		ПО АрендаНоменклатуры.Контрагент = ДокументыФизическихЛицСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияАдрес
	|		ПО АрендаНоменклатуры.Партнер = ПартнерыКонтактнаяИнформацияАдрес.Ссылка
	|			И (ПартнерыКонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПартнера))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияТелефон
	|		ПО (АрендаНоменклатуры.Партнер = ПартнерыКонтактнаяИнформацияАдрес.Ссылка)
	|			И (ПартнерыКонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АрендаНоменклатуры.Товары КАК АрендаНоменклатурыТовары
	|		ПО АрендаНоменклатуры.Ссылка = АрендаНоменклатурыТовары.Ссылка
	|ГДЕ
	|	АрендаНоменклатуры.Ссылка В(&МассивОбъектов)
	|	И АрендаНоменклатуры.Статус = &Статус
	|	И НЕ Сотрудники.Уволен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеДокумента.Ссылка КАК Ссылка,
	|	втДанныеДокумента.Номер КАК Номер,
	|	втДанныеДокумента.Дата КАК Дата,
	|	втДанныеДокумента.ИНН КАК ИНН,
	|	втДанныеДокумента.Подразделение КАК Подразделение,
	|	втДанныеДокумента.ПодразделениеАдрес КАК ПодразделениеАдрес,
	|	втДанныеДокумента.Сотрудник КАК Сотрудник,
	|	втДанныеДокумента.Должность КАК Должность,
	|	втДанныеДокумента.КлиентФИО КАК КлиентФИО,
	|	втДанныеДокумента.Паспорт КАК Паспорт,
	|	втДанныеДокумента.Организация КАК Организация,
	|	втДанныеДокумента.КлиентАдрес КАК КлиентАдрес,
	|	втДанныеДокумента.НомерТелефона КАК НомерТелефона,
	|	втДанныеДокумента.Номенклатура КАК Номенклатура,
	|	втДанныеДокумента.Характеристика КАК Характеристика,
	|	втДанныеДокумента.ЦенаУслуги КАК ЦенаУслуги,
	|	втДанныеДокумента.КоличествоУслуги КАК КоличествоУслуги,
	|	втДанныеДокумента.СуммаЗалога КАК СуммаЗалога,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК СтоимостьИнструмента
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО втДанныеДокумента.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И втДанныеДокумента.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			И втДанныеДокумента.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Статус", Статус);
	Запрос.УстановитьПараметр("Период", МассивОбъектов[МассивОбъектов.Количество()-1].Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса; 
	
КонецФункции

#КонецОбласти 

#КонецЕсли
